app/controllers/listings_controller.rb

  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 9 ORDER BY created_at DESC

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings" ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 1  [["image_file_name", "couplepillows.jpg"], ["image_file_size", 39823], ["image_updated_at", Mon, 19 May 2014 21:25:49 UTC +00:00], ["updated_at", Mon, 19 May 2014 21:25:50 UTC +00:00]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 2]]

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "2"]]